## Staging: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.platform-admin-looking-at-sensitive-service-new will be created
  + resource "aws_cloudwatch_log_metric_filter" "platform-admin-looking-at-sensitive-service-new" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name           = "platform-admin-looking-at-sensitive-service-new"
      + pattern        = "\"Sensitive Admin API request\""

      + metric_transformation {
          + default_value = "0"
          + name          = "platform-admin-looking-at-sensitive-service-new"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.platform-admin-looking-at-sensitive-service-warning-new will be created
  + resource "aws_cloudwatch_metric_alarm" "platform-admin-looking-at-sensitive-service-warning-new" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "A platform admin is looking at a sensitive service on the admin (new)"
      + alarm_name                            = "platform-admin-looking-at-sensitive-service-warning-new"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-admin-looking-at-sensitive-service-new"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>